{"id": "2506.22648", "categories": ["cs.IR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.22648", "abs": "https://arxiv.org/abs/2506.22648", "authors": ["Pedro R. Pires", "Tiago A. Almeida"], "title": "Interact2Vec -- An efficient neural network-based model for simultaneously learning users and items embeddings in recommender systems", "comment": "Accepted for publication in Applied Soft Computing (ASOC), 49 pages,\n  14 figures", "summary": "Over the past decade, recommender systems have experienced a surge in\npopularity. Despite notable progress, they grapple with challenging issues,\nsuch as high data dimensionality and sparseness. Representing users and items\nas low-dimensional embeddings learned via neural networks has become a leading\nsolution. However, while recent studies show promising results, many approaches\nrely on complex architectures or require content data, which may not always be\navailable. This paper presents Interact2Vec, a novel neural network-based model\nthat simultaneously learns distributed embeddings for users and items while\ndemanding only implicit feedback. The model employs state-of-the-art strategies\nthat natural language processing models commonly use to optimize the training\nphase and enhance the final embeddings. Two types of experiments were conducted\nregarding the extrinsic and intrinsic quality of the model. In the former, we\nbenchmarked the recommendations generated by Interact2Vec's embeddings in a\ntop-$N$ ranking problem, comparing them with six other recommender algorithms.\nThe model achieved the second or third-best results in 30\\% of the datasets,\nbeing competitive with other recommenders, and has proven to be very efficient\nwith an average training time reduction of 274\\% compared to other\nembedding-based models. Later, we analyzed the intrinsic quality of the\nembeddings through similarity tables. Our findings suggest that Interact2Vec\ncan achieve promising results, especially on the extrinsic task, and is an\nexcellent embedding-generator model for scenarios of scarce computing\nresources, enabling the learning of item and user embeddings simultaneously and\nefficiently."}
{"id": "2506.23026", "categories": ["cs.IR"], "pdf": "https://arxiv.org/pdf/2506.23026", "abs": "https://arxiv.org/abs/2506.23026", "authors": ["Yongsheng Lian"], "title": "Machine Assistant with Reliable Knowledge: Enhancing Student Learning via RAG-based Retrieval", "comment": null, "summary": "We present Machine Assistant with Reliable Knowledge (MARK), a\nretrieval-augmented question-answering system designed to support student\nlearning through accurate and contextually grounded responses. The system is\nbuilt on a retrieval-augmented generation (RAG) framework, which integrates a\ncurated knowledge base to ensure factual consistency. To enhance retrieval\neffectiveness across diverse question types, we implement a hybrid search\nstrategy that combines dense vector similarity with sparse keyword-based\nretrieval. This dual-retrieval mechanism improves robustness for both general\nand domain-specific queries. The system includes a feedback loop in which\nstudents can rate responses and instructors can review and revise them.\nInstructor corrections are incorporated into the retrieval corpus, enabling\nadaptive refinement over time. The system was deployed in a classroom setting\nas a substitute for traditional office hours, where it successfully addressed a\nbroad range of student queries. It was also used to provide technical support\nby integrating with a customer-specific knowledge base, demonstrating its\nability to handle routine, context-sensitive tasks in applied domains. MARK is\npublicly accessible at https://app.eduquery.ai."}
{"id": "2506.23060", "categories": ["cs.IR"], "pdf": "https://arxiv.org/pdf/2506.23060", "abs": "https://arxiv.org/abs/2506.23060", "authors": ["Zhibo Fan", "Hongtao Lin", "Haoyu Chen", "Bowen Deng", "Hedi Xia", "Yuke Yan", "James Li"], "title": "Synergizing Implicit and Explicit User Interests: A Multi-Embedding Retrieval Framework at Pinterest", "comment": "KDD 2025", "summary": "Industrial recommendation systems are typically composed of multiple stages,\nincluding retrieval, ranking, and blending. The retrieval stage plays a\ncritical role in generating a high-recall set of candidate items that covers a\nwide range of diverse user interests. Effectively covering the diverse and\nlong-tail user interests within this stage poses a significant challenge:\ntraditional two-tower models struggle in this regard due to limited user-item\nfeature interaction and often bias towards top use cases. To address these\nissues, we propose a novel multi-embedding retrieval framework designed to\nenhance user interest representation by generating multiple user embeddings\nconditioned on both implicit and explicit user interests. Implicit interests\nare captured from user history through a Differentiable Clustering Module\n(DCM), whereas explicit interests, such as topics that the user has followed,\nare modeled via Conditional Retrieval (CR). These methodologies represent a\nform of conditioned user representation learning that involves condition\nrepresentation construction and associating the target item with the relevant\nconditions. Synergizing implicit and explicit user interests serves as a\ncomplementary approach to achieve more effective and comprehensive candidate\nretrieval as they benefit on different user segments and extract conditions\nfrom different but supplementary sources. Extensive experiments and A/B testing\nreveal significant improvements in user engagements and feed diversity metrics.\nOur proposed framework has been successfully deployed on Pinterest home feed."}
{"id": "2506.23085", "categories": ["cs.IR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.23085", "abs": "https://arxiv.org/abs/2506.23085", "authors": ["Saeid Aghasoleymani Najafabadi"], "title": "Enhancing Live Broadcast Engagement: A Multi-modal Approach to Short Video Recommendations Using MMGCN and User Preferences", "comment": null, "summary": "The purpose of this paper is to explore a multi-modal approach to enhancing\nlive broadcast engagement by developing a short video recommendation system\nthat incorporates Multi-modal Graph Convolutional Networks (MMGCN) with user\npreferences. In order to provide personalized recommendations tailored to\nindividual interests, the proposed system takes into account user interaction\ndata, video content features, and contextual information. With the aid of a\nhybrid approach combining collaborative filtering and content-based filtering\ntechniques, the system is able to capture nuanced relationships between users,\nvideo attributes, and engagement patterns. Three datasets are used to evaluate\nthe effectiveness of the system: Kwai, TikTok, and MovieLens. Compared to\nbaseline models, such as DeepFM, Wide & Deep, LightGBM, and XGBoost, the\nproposed MMGCN-based model shows superior performance. A notable feature of the\nproposed model is that it outperforms all baseline methods in capturing diverse\nuser preferences and making accurate, personalized recommendations, resulting\nin a Kwai F1 score of 0.574, a Tiktok F1 score of 0.506, and a MovieLens F1\nscore of 0.197. We emphasize the importance of multi-modal integration and\nuser-centric approaches in advancing recommender systems, emphasizing the role\nthey play in enhancing content discovery and audience interaction on live\nbroadcast platforms."}
{"id": "2506.23090", "categories": ["cs.IR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.23090", "abs": "https://arxiv.org/abs/2506.23090", "authors": ["Langming Liu", "Wanyu Wang", "Chi Zhang", "Bo Li", "Hongzhi Yin", "Xuetao Wei", "Wenbo Su", "Bo Zheng", "Xiangyu Zhao"], "title": "Multi-task Offline Reinforcement Learning for Online Advertising in Recommender Systems", "comment": "KDD 2025", "summary": "Online advertising in recommendation platforms has gained significant\nattention, with a predominant focus on channel recommendation and budget\nallocation strategies. However, current offline reinforcement learning (RL)\nmethods face substantial challenges when applied to sparse advertising\nscenarios, primarily due to severe overestimation, distributional shifts, and\noverlooking budget constraints. To address these issues, we propose MTORL, a\nnovel multi-task offline RL model that targets two key objectives. First, we\nestablish a Markov Decision Process (MDP) framework specific to the nuances of\nadvertising. Then, we develop a causal state encoder to capture dynamic user\ninterests and temporal dependencies, facilitating offline RL through\nconditional sequence modeling. Causal attention mechanisms are introduced to\nenhance user sequence representations by identifying correlations among causal\nstates. We employ multi-task learning to decode actions and rewards,\nsimultaneously addressing channel recommendation and budget allocation.\nNotably, our framework includes an automated system for integrating these tasks\ninto online advertising. Extensive experiments on offline and online\nenvironments demonstrate MTORL's superiority over state-of-the-art methods."}
{"id": "2506.23170", "categories": ["cs.IR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.23170", "abs": "https://arxiv.org/abs/2506.23170", "authors": ["Jaime Hieu Do", "Trung-Hoang Le", "Hady W. Lauw"], "title": "Compositions of Variant Experts for Integrating Short-Term and Long-Term Preferences", "comment": null, "summary": "In the online digital realm, recommendation systems are ubiquitous and play a\ncrucial role in enhancing user experience. These systems leverage user\npreferences to provide personalized recommendations, thereby helping users\nnavigate through the paradox of choice. This work focuses on personalized\nsequential recommendation, where the system considers not only a user's\nimmediate, evolving session context, but also their cumulative historical\nbehavior to provide highly relevant and timely recommendations. Through an\nempirical study conducted on diverse real-world datasets, we have observed and\nquantified the existence and impact of both short-term (immediate and\ntransient) and long-term (enduring and stable) preferences on users' historical\ninteractions. Building on these insights, we propose a framework that combines\nshort- and long-term preferences to enhance recommendation performance, namely\nCompositions of Variant Experts (CoVE). This novel framework dynamically\nintegrates short- and long-term preferences through the use of different\nspecialized recommendation models (i.e., experts). Extensive experiments\nshowcase the effectiveness of the proposed methods and ablation studies further\ninvestigate the impact of variant expert types."}
{"id": "2506.23191", "categories": ["cs.IR"], "pdf": "https://arxiv.org/pdf/2506.23191", "abs": "https://arxiv.org/abs/2506.23191", "authors": ["Gabriel Iturra-Bocaz", "Danny Vo", "Petra Galuscakova"], "title": "Impact of Shallow vs. Deep Relevance Judgments on BERT-based Reranking Models", "comment": "Accepted at ICTIR'25", "summary": "This paper investigates the impact of shallow versus deep relevance judgments\non the performance of BERT-based reranking models in neural Information\nRetrieval. Shallow-judged datasets, characterized by numerous queries each with\nfew relevance judgments, and deep-judged datasets, involving fewer queries with\nextensive relevance judgments, are compared. The research assesses how these\ndatasets affect the performance of BERT-based reranking models trained on them.\nThe experiments are run on the MS MARCO and LongEval collections. Results\nindicate that shallow-judged datasets generally enhance generalization and\neffectiveness of reranking models due to a broader range of available contexts.\nThe disadvantage of the deep-judged datasets might be mitigated by a larger\nnumber of negative training examples."}
{"id": "2506.23319", "categories": ["cs.IR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.23319", "abs": "https://arxiv.org/abs/2506.23319", "authors": ["Norman Knyazev", "Harrie Oosterhuis"], "title": "Learning to Rank with Variable Result Presentation Lengths", "comment": "SIGIR 2025", "summary": "Learning to Rank (LTR) methods generally assume that each document in a top-K\nranking is presented in an equal format. However, previous work has shown that\nusers' perceptions of relevance can be changed by varying presentations, i.e.,\nallocating more vertical space to some documents to provide additional textual\nor image information. Furthermore, presentation length can also redirect\nattention, as users are more likely to notice longer presentations when\nscrolling through results. Deciding on the document presentation lengths in a\nfixed vertical space ranking is an important problem that has not been\naddressed by existing LTR methods.\n  We address this gap by introducing the variable presentation length ranking\ntask, where simultaneously the ordering of documents and their presentation\nlength is decided. Despite being a generalization of standard ranking, we show\nthat this setting brings significant new challenges: Firstly, the probability\nranking principle no longer applies to this setting, and secondly, the problem\ncannot be divided into separate ordering and length selection tasks.\n  We therefore propose VLPL - a new family of Plackett-Luce list-wise gradient\nestimation methods for the joint optimization of document ordering and lengths.\nOur semi-synthetic experiments show that VLPL can effectively balance the\nexpected exposure and attractiveness of all documents, achieving the best\nperformance across different ranking settings. Furthermore, we observe that\neven simple length-aware methods can achieve significant performance\nimprovements over fixed-length models. Altogether, our theoretical and\nempirical results highlight the importance and difficulties of combining\ndocument presentation with LTR."}
{"id": "2506.23394", "categories": ["cs.IR", "cs.AI", "cs.CL", "I.2.7; I.2.1"], "pdf": "https://arxiv.org/pdf/2506.23394", "abs": "https://arxiv.org/abs/2506.23394", "authors": ["Simeon Emanuilov"], "title": "Teaching a Language Model to Speak the Language of Tools", "comment": null, "summary": "External tool integration through function-calling is essential for practical\nlanguage model applications, yet most multilingual models lack reliable\ntool-use capabilities in non-English languages. Even state-of-the-art\nmultilingual models struggle with determining when to use tools and generating\nthe structured outputs required for function calls, often exhibiting language\nconfusion when prompted in lower-resource languages. This work presents a\nmethodology for adapting existing language models to enable robust tool use in\nany target language, using Bulgarian as a case study. The approach involves\ncontinued training of the BgGPT model series (2.6B, 9B, 27B parameters) on a\nnovel bilingual dataset of 10,035 function-calling examples designed to support\nstandardized protocols like MCP (Model Context Protocol). The research\nintroduces TUCAN (Tool-Using Capable Assistant Navigator), which achieves up to\n28.75% improvement in function-calling accuracy over base models while\npreserving core language understanding, as verified on established Bulgarian\nbenchmarks. Beyond accuracy gains, TUCAN models demonstrate production-ready\nresponse formatting with clean, parsable function calls, contrasting with the\nverbose and inconsistent outputs of base models. The models, evaluation\nframework, and dataset are released to enable replication for other languages.\nThis work demonstrates a practical approach for extending tool-augmented\ncapabilities beyond English-centric systems."}
{"id": "2506.23397", "categories": ["cs.IR", "cs.DB"], "pdf": "https://arxiv.org/pdf/2506.23397", "abs": "https://arxiv.org/abs/2506.23397", "authors": ["Gaurav Sehgal", "Semih Salihoglu"], "title": "NaviX: A Native Vector Index Design for Graph DBMSs With Robust Predicate-Agnostic Search Performance", "comment": null, "summary": "There is an increasing demand for extending existing DBMSs with vector\nindices so that they become unified systems capable of supporting modern\npredictive applications, which require joint querying of vector embeddings\ntogether with the structured properties and connections of objects. We present\nNaviX, a native vector index for graph DBMSs (GDBMSs) that has two main design\ngoals. First, we aim to implement a disk-based vector index that leverages the\ncore storage and query-processing capabilities of the underlying GDBMS. To this\nend, NaviX is built on the Hierarchical Navigable Small-World (HNSW) graph,\nwhich itself is a graph-based structure. Second, we aim to support\npredicate-agnostic filtered vector search queries, in which the k nearest\nneighbors (kNNs) of a query vector vQ are searched only within an arbitrary\nsubset S of vectors defined by an ad-hoc selection sub-query QS. We adopt a\nprefiltering approach that evaluates QS first and passes the full description\nof subset S to the kNN search operator. We study how to design a prefiltering\nsearch algorithm that remains robust under varying selectivities and under\ndifferent correlations between subset S and query vector vQ. We propose an\nadaptive algorithm that uses the local selectivity of each vector in the HNSW\ngraph to choose an appropriate heuristic at every iteration of the kNN search.\nFinally, We demonstrate NaviX's robustness and efficiency through extensive\nexperiments against both existing prefiltering- and postfiltering-based\nbaselines."}
{"id": "2506.23471", "categories": ["cs.IR", "cs.CV"], "pdf": "https://arxiv.org/pdf/2506.23471", "abs": "https://arxiv.org/abs/2506.23471", "authors": ["Thanh-Tung Phan-Nguyen", "Khoi-Nguyen Nguyen-Ngoc", "Tam V. Nguyen", "Minh-Triet Tran", "Trung-Nghia Le"], "title": "KiseKloset: Comprehensive System For Outfit Retrieval, Recommendation, And Try-On", "comment": null, "summary": "The global fashion e-commerce industry has become integral to people's daily\nlives, leveraging technological advancements to offer personalized shopping\nexperiences, primarily through recommendation systems that enhance customer\nengagement through personalized suggestions. To improve customers' experience\nin online shopping, we propose a novel comprehensive KiseKloset system for\noutfit retrieval, recommendation, and try-on. We explore two approaches for\noutfit retrieval: similar item retrieval and text feedback-guided item\nretrieval. Notably, we introduce a novel transformer architecture designed to\nrecommend complementary items from diverse categories. Furthermore, we enhance\nthe overall performance of the search pipeline by integrating approximate\nalgorithms to optimize the search process. Additionally, addressing the crucial\nneeds of online shoppers, we employ a lightweight yet efficient virtual try-on\nframework capable of real-time operation, memory efficiency, and maintaining\nrealistic outputs compared to its predecessors. This virtual try-on module\nempowers users to visualize specific garments on themselves, enhancing the\ncustomers' experience and reducing costs associated with damaged items for\nretailers. We deployed our end-to-end system for online users to test and\nprovide feedback, enabling us to measure their satisfaction levels. The results\nof our user study revealed that 84% of participants found our comprehensive\nsystem highly useful, significantly improving their online shopping experience."}
{"id": "2506.23643", "categories": ["cs.IR"], "pdf": "https://arxiv.org/pdf/2506.23643", "abs": "https://arxiv.org/abs/2506.23643", "authors": ["Yifan Wang", "Weinan Gan", "Longtao Xiao", "Jieming Zhu", "Heng Chang", "Haozhao Wang", "Rui Zhang", "Zhenhua Dong", "Ruiming Tang", "Ruixuan Li"], "title": "Act-With-Think: Chunk Auto-Regressive Modeling for Generative Recommendation", "comment": "9 pages, 2 figures", "summary": "Generative recommendation (GR) typically encodes behavioral or semantic\naspects of item information into discrete tokens, leveraging the standard\nautoregressive (AR) generation paradigm to make predictions. However, existing\nmethods tend to overlook their intrinsic relationship, that is, the semantic\nusually provides some reasonable explainability \"$\\textbf{why}$\" for the\nbehavior \"$\\textbf{what}$\", which may constrain the full potential of GR. To\nthis end, we present Chunk AutoRegressive Modeling (CAR), a new generation\nparadigm following the decision pattern that users usually think semantic\naspects of items (e.g. brand) and then take actions on target items (e.g.\npurchase). Our CAR, for the $\\textit{first time}$, incorporates semantics\n(SIDs) and behavior (UID) into a single autoregressive transformer from an\n``act-with-think'' dual perspective via chunk-level autoregression.\nSpecifically, CAR packs SIDs and UID into a conceptual chunk for item unified\nrepresentation, allowing each decoding step to make a holistic prediction.\nExperiments show that our CAR significantly outperforms existing methods based\non traditional AR, improving Recall@5 by 7.93% to 22.30%. Furthermore, we\nverify the scaling effect between model performance and SIDs bit number,\ndemonstrating that CAR preliminary emulates a kind of slow-thinking style\nmechanism akin to the reasoning processes observed in large language models\n(LLMs)."}
